Repository: Abrifq/slimbookamdcontroller
Catalog: src/locale/*/LC_MESSAGES/slimbookamdcontrollerinfo.template.po
Languages: it_it

source: The Slimbook AMD Controller app is capable of setting several TDP power levels for your AMD Ryzen mobile processor. Switching between the different performance presets will give you the ability to control both performance and battery life with a single click. Bear in mind that the higher you set your performance level, your processor will also run hotter and drain your battery faster, so keep that in mind! Slimbook AMD Controller uses the third party software RyzenAdj from FlyGoat.
it_it: L'app Slimbook AMD Controller è in grado di impostare diversi livelli di potenza TDP per il tuo processore mobile AMD Ryzen. Il passaggio tra i diversi preset delle prestazioni ti darà la possibilità di controllare sia le prestazioni che la durata della batteria con un solo clic. Tieni presente che più alto è il tuo livello di prestazioni, anche il tuo processore si surriscalda e scarica la batteria più velocemente, quindi tienilo a mente! Il controller AMD Slimbook utilizza il software di terze parti RyzenAdj di FlyGoat.

source: or buying a brand new Slimbook.
it_it: o acquistando un nuovissimo Slimbook.

source: If you want to support the Slimbook team with the development of this app and several more to come, you can do so by joining our
it_it: Se vuoi supportare il team di Slimbook con lo sviluppo di questa app e molte altre in arrivo, puoi farlo unendoti al nostro

source: Many laptops limit the power of the CPU, when working without the charger connected. Therefore, if you want to take advantage of the high-performance mode of this application, you may need to connect the charger.
it_it: Molti laptop limitano la potenza della CPU, quando si lavora senza il caricabatterie collegato. Pertanto, se si desidera sfruttare la modalità ad alte prestazioni di questa applicazione, potrebbe essere necessario collegare il caricabatterie.

source: Note:
it_it: Nota:

source: This software is provided * as is * without warranty of any kind..
it_it: Questo software viene fornito *così com'è* senza garanzie di alcun tipo..

source: You are free from:
it_it: Sei libero di:

source: Share:
it_it: Condividere:

source: copy and redistribute the material in any medium or format Slimbook Copyright - License Creative Commons BY-NC-ND
it_it: copiare e ridistribuire il materiale in qualsiasi supporto o formato Slimbook Copyright - Licenza Creative Commons BY-NC-ND

source: @Visit Slimbook web
it_it: @Visita Slimbook web

source: Help us with translations!
it_it: Aiutaci con le traduzioni!

source: Send an e-mail a:
it_it: Invia una e-mail a:

source: 'The email has been copied to the clipboard'
it_it: 'L' email è stata copiata negli appunti'
