Repository: Abrifq/slimbookamdcontroller
Catalog: src/translations/*/LC_MESSAGES/slimbookamdcontrollerinfo.po
Languages: es_es

source: The Slimbook AMD Controller app is capable of setting several TDP power levels for your AMD Ryzen mobile processor. Switching between the different performance presets will give you the ability to control both performance and battery life with a single click. Bear in mind that the higher you set your performance level, your processor will also run hotter and drain your battery faster, so keep that in mind! Slimbook AMD Controller uses the third party software RyzenAdj from FlyGoat.
es_es: La aplicación Slimbook AMD Controller es capaz de configurar varios niveles de potencia TDP para su procesador AMD Ryzen. Cambiar los diferentes ajustes preestablecidos de rendimiento le dará la capacidad de controlar tanto el rendimiento como la duración de la batería con un solo clic. Tenga en cuenta que cuanto más alto establezca su nivel de rendimiento, su procesador se calentará más y agotará su batería más rápido, ¡así que ten cuidado! Slimbook AMD Controller utiliza el software de terceros RyzenAdj de FlyGoat.

source: Many laptops limit the power of the CPU, when working without the charger connected. Therefore, if you want to take advantage of the high-performance mode of this application, you may need to connect the charger.
es_es: Muchos portátiles limitan la potencia de la CPU cuando se trabaja sin el cargador conectado. Por lo tanto, si desea aprovechar el modo de alto rendimiento de esta aplicación, es posible que necesite conectar el cargador.

source: Note:
es_es: Nota:

source: or buying a brand new Slimbook.
es_es: o comprando un Slimbook.

source: If you want to support the Slimbook team with the development of this app and several more to come, you can do so by joining our
es_es: Si quieres apoyar al equipo de Slimbook con el desarrollo de esta aplicación y varias más , puedes hacerlo uniéndote a nuestro

source: This software is provided * as is * without warranty of any kind..
es_es: Este software se proporciona *tal cual* sin garantía de ningún tipo.

source: You are free from:
es_es: Usted es libre de:

source: Share:
es_es: Compartir:

source: copy and redistribute the material in any medium or format Slimbook Copyright - License Creative Commons BY-NC-ND
es_es: copiar y redistribuir el material en cualquier medio o formato Slimbook Copyright - License Creative Commons BY-NC-ND

source: @Visit Slimbook web
es_es: @Visita la web de slimbook

source: @SlimbookAMDController Tutorial
es_es: @Tutorial SlimbookAMDController

source: Send an e-mail a:
es_es: Envíe un correo electrónico a:

source: 'The email has been copied to the clipboard'
es_es: 'El correo electrónico ha sido copiado en el portapapeles'
